Catalogs/МЙ_ПродукцияВетис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МЙ_ПродукцияВетис</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ТипыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ВидПродукцииВетис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ЦелиВвозаВывоза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МЙ_ВидПродукцииВетис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МЙ_ВидПродукцииВетис</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ТипыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МЙ_ПродукцияВетис/Ext/ManagerModule.bsl
//+++АК LATV 2018.10.01 ИП-00019985
Функция ЗагрузитьСписокИзВетис(Параметры, АдресХранилища) Экспорт

	Прокси = ОбменССистемойВетис.ПолучитьПроксиProduct(Параметры.НастройкаApi);
	ListOptions = ОбменССистемойВетис.ПолучитьListOptionsИзПрокси(Прокси);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЙ_ТипыПродукции.Код КАК Код,
		|	МЙ_ТипыПродукции.Наименование,
		|	МЙ_ТипыПродукции.Ссылка
		|ИЗ
		|	Справочник.МЙ_ТипыПродукции КАК МЙ_ТипыПродукции
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Группа = Справочники.МЙ_ПродукцияВетис.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование);
		Если Группа.Пустая() Тогда
			Группа = Справочники.МЙ_ПродукцияВетис.СоздатьГруппу();
			Группа.Код=Формат(Число(ВыборкаДетальныеЗаписи.Код),"ЧЦ=9; ЧВН=; ЧГ=");
			Группа.Наименование=ВыборкаДетальныеЗаписи.Наименование;
			Группа.Записать();
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МЙ_ВидПродукцииВетис.Ссылка,
			|	МЙ_ВидПродукцииВетис.Родитель,
			|	МЙ_ВидПродукцииВетис.ЭтоГруппа,
			|	МЙ_ВидПродукцииВетис.Наименование,
			|	МЙ_ВидПродукцииВетис.Код
			|ИЗ
			|	Справочник.МЙ_ВидПродукцииВетис КАК МЙ_ВидПродукцииВетис
			|ГДЕ
			|	МЙ_ВидПродукцииВетис.Родитель = &Родитель";
		Запрос.УстановитьПараметр("Родитель", справочники.МЙ_ВидПродукцииВетис.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи2 = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
			Группа2=справочники.МЙ_ПродукцияВетис.НайтиПоКоду(ВыборкаДетальныеЗаписи2.Код);
			Если Группа2.Пустая() Тогда
				Группа2=справочники.МЙ_ПродукцияВетис.СоздатьГруппу();
			Иначе
				Группа2=Группа2.ПолучитьОбъект();
			КонецЕсли;
			Группа2.Наименование=ВыборкаДетальныеЗаписи2.Наименование;
			Группа2.Код=ВыборкаДетальныеЗаписи2.Код;
			Группа2.Родитель=Группа.Ссылка;
			//Состояние(Строка(Группа.Наименование)+"-"+Строка(Группа.ЭтоГруппа)+"  -  "+Строка(Группа2.Наименование));
			Группа2.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
	// Заполним продукцию по группам
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЙ_ПродукцияВетис.ЭтоГруппа,
		|	МЙ_ПродукцияВетис.Код КАК Код,
		|	МЙ_ПродукцияВетис.Ссылка
		|ИЗ
		|	Справочник.МЙ_ПродукцияВетис КАК МЙ_ПродукцияВетис
		|ГДЕ
		|	МЙ_ПродукцияВетис.ЭтоГруппа = ИСТИНА
		|	И МЙ_ПродукцияВетис.Родитель.Ссылка ЕСТЬ НЕ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КодЭл=100000000;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидПРод=Справочники.МЙ_ВидПродукцииВетис.НайтиПоКоду(ВыборкаДетальныеЗаписи.код);
		Группа=Справочники.МЙ_ПродукцияВетис.НайтиПоКоду(ВыборкаДетальныеЗаписи.код);
		Смещение1 = 0;
		Пока Истина Цикл
			ListOptions.offset = Смещение1;
			
			Ответ1 = Прокси.GetSubProductByProductList(ListOptions,ВидПРод.GUID);
			Для Каждого стр1 из Ответ1.subProduct Цикл
				КодЭл=КодЭл+1;
				Эл=Справочники.МЙ_ПродукцияВетис.НайтиПоРеквизиту("GUID",стр1.GUID);
				Если Эл.Ссылка.Пустая() Тогда
					эл=справочники.МЙ_ПродукцияВетис.СоздатьЭлемент();				
				Иначе
					Эл=эл.ПолучитьОбъект();
				КонецЕсли;
				
				Эл.GUID=стр1.GUID;
				эл.UUID=стр1.UUID;
				Эл.Наименование=Стр1.name;
				Эл.Статус = Стр1.status;
				Эл.Родитель=Группа.Ссылка;
				Эл.Коды=стр1.code;
				Эл.РодительGUID=Видпрод.GUID;
				Эл.РодительНаименование=ВидПРод.Наименование;
				Эл.ТипПродукции=ВидПРод.ТипПродукции.Ссылка;
				Эл.ВидПродукции=ВидПРод.Ссылка;
				Эл.Активность=стр1.active;
				Эл.Записать();
				//Состояние(Стр1.name);
				
			КонецЦикла;
			Если Ответ1.Count + Смещение1 >= Ответ1.Total Тогда
				Прервать;
			КонецЕсли;
			Смещение1 = Смещение1 + ListOptions.Count;
			
		КонецЦикла;
	КонецЦикла;

КонецФункции
